InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НастройкиКонтроляПрайсЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НастройкиКонтроляПрайсЛистов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоВидамНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоНоменклатуре</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/УстановкаЦенВызовСервера/Ext/Module.bsl
Функция ИмяКолонкиПоВидуЦены(ВидЦены) Экспорт
	
	Возврат УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(ВидЦены);
	
КонецФункции

//++ №14786 Выполняет контроль прайс-листов по документу "Настройки контроля прайс-листов"
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПоступлениеТоваровИУслуг - ссылка на документ с табличной частью Товары
// 
// Возвращаемое значение:
//  Массив - содержащий данные в структурах для заполнения документа "Установка цен номенклатуры"
//	если массив пустой, то к установке нету данных
//
Функция ВыполнитьКонтрольПрайсЛистов(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивЦенКУстановке = новый Массив;
	
	// Сначала нужно найти документ настройки контроля, если нет подходящего контроль не выполняем
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиКонтроляПрайсЛистов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НастройкиКонтроляПрайсЛистов КАК НастройкиКонтроляПрайсЛистов
	|ГДЕ
	|	НастройкиКонтроляПрайсЛистов.Дата <= &Дата
	|	И НастройкиКонтроляПрайсЛистов.Организация = &Организация
	|	И НастройкиКонтроляПрайсЛистов.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиКонтроляПрайсЛистов.Дата УБЫВ
	|";
	Запрос.УстановитьПараметр("Дата", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокументКонтроля = Выборка.Ссылка;
	Иначе
		Возврат МассивЦенКУстановке;
	КонецЕсли;
	
	Товары = ДокументСсылка.Товары.Выгрузить();
	
	Товары.Колонки.Добавить("ГруппаНоменклатуры", 	новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Категория", 			новый ОписаниеТипов("СправочникСсылка.КатегорияНоменклатуры"));
	Товары.Колонки.Добавить("ВидНоменклатуры", 		новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Товары.Колонки.Добавить("ВидЦены", 				новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	Товары.Колонки.Добавить("Валюта", 				новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Товары.Колонки.Добавить("Процент", 				новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(6, 2)));
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		ТекущаяСтрока.ВидНоменклатуры = ТекущаяСтрока.Номенклатура.ВидНоменклатуры;
		ТекущаяСтрока.Категория = ТекущаяСтрока.Номенклатура.Категория;
		
	КонецЦикла;
	
	МассивНоменклатур = Товары.ВыгрузитьКолонку("Номенклатура");
	
	// Далее получим данные для контроля по "Группам номенклатуры" т.к. это сложный контроль с учётом иерархии
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиКонтроляПрайсЛистовНастройки.Номенклатура КАК ГруппаНоменклатуры,
	|	НастройкиКонтроляПрайсЛистовНастройки.ВидЦены КАК ВидЦены,
	|	НастройкиКонтроляПрайсЛистовНастройки.Валюта КАК Валюта,
	|	НастройкиКонтроляПрайсЛистовНастройки.Процент КАК Процент,
	|	0 КАК Уровень
	|ИЗ
	|	Документ.НастройкиКонтроляПрайсЛистов.НастройкиПоНоменклатуре КАК НастройкиКонтроляПрайсЛистовНастройки
	|ГДЕ
	|	НастройкиКонтроляПрайсЛистовНастройки.Номенклатура.ЭтоГруппа
	|	И НастройкиКонтроляПрайсЛистовНастройки.Ссылка = &ДокументКонтроля
	|";
	Запрос.УстановитьПараметр("ДокументКонтроля", ДокументКонтроля);
	
	НастройкиКонтроляПоГруппам = Запрос.Выполнить().Выгрузить();
	
	// Сделаем сортировку по уровням, чтобы если например выбрали и основную группу и ещё подгруппу из этой группы
	// тогда подгруппа будет более высокая по приоритету (обработается в конце)
	Для Каждого ТекущаяСтрока Из НастройкиКонтроляПоГруппам Цикл
		ТекущаяСтрока.Уровень = ТекущаяСтрока.ГруппаНоменклатуры.Уровень();
	КонецЦикла;
	
	НастройкиКонтроляПоГруппам.Сортировать("Уровень");
	
	// Делаем в цикле по кажой группе номенклатуры, т.к. в ИЕРАРХИИ и нам нужно знать по какой конечной группе идёт контроль
	Для Каждого НастройкаКонтроляПоГруппам Из НастройкиКонтроляПоГруппам Цикл
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В (&МассивНоменклатур)
		|	И Номенклатура.Ссылка В ИЕРАРХИИ (&ГруппаНоменклатуры)
		|";
		Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);
		Запрос.УстановитьПараметр("ГруппаНоменклатуры", НастройкаКонтроляПоГруппам.ГруппаНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			// Заполняем полученные настройки по группам в ТЧ Товары
			НайденныеСтроки = Товары.НайтиСтроки(новый Структура("Номенклатура", Выборка.Номенклатура));
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока, НастройкаКонтроляПоГруппам);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "
	// Настройки контроля "Вид номенклатуры" с учётом категории
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиКонтроляПрайсЛистовНастройки.ВидНоменклатуры КАК ВидНоменклатуры,
	|	НастройкиКонтроляПрайсЛистовНастройки.Категория КАК Категория,
	|	НастройкиКонтроляПрайсЛистовНастройки.ВидЦены КАК ВидЦены,
	|	НастройкиКонтроляПрайсЛистовНастройки.Валюта КАК Валюта,
	|	НастройкиКонтроляПрайсЛистовНастройки.Процент КАК Процент
	|ПОМЕСТИТЬ ВТ_НастройкаКонтроляПоВидуНоменклатуры
	|ИЗ
	|	Документ.НастройкиКонтроляПрайсЛистов.НастройкиПоВидамНоменклатуры КАК НастройкиКонтроляПрайсЛистовНастройки
	|ГДЕ
	|	НастройкиКонтроляПрайсЛистовНастройки.Ссылка = &ДокументКонтроля
	|	И НЕ НастройкиКонтроляПрайсЛистовНастройки.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|
	|;
	|///////////////////////////////////////
	// Настройки контроля "Номенклатура" (только элементы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиКонтроляПрайсЛистовНастройки.Номенклатура КАК Номенклатура,
	|	НастройкиКонтроляПрайсЛистовНастройки.ВидЦены КАК ВидЦены,
	|	НастройкиКонтроляПрайсЛистовНастройки.Валюта КАК Валюта,
	|	НастройкиКонтроляПрайсЛистовНастройки.Процент КАК Процент
	|ПОМЕСТИТЬ ВТ_НастройкаКонтроляПоНоменклатуре
	|ИЗ
	|	Документ.НастройкиКонтроляПрайсЛистов.НастройкиПоНоменклатуре КАК НастройкиКонтроляПрайсЛистовНастройки
	|ГДЕ
	|	НЕ НастройкиКонтроляПрайсЛистовНастройки.Номенклатура.ЭтоГруппа
	|	И НастройкиКонтроляПрайсЛистовНастройки.Ссылка = &ДокументКонтроля
	|
	|;
	|///////////////////////////////////////
	// Исходная ТЧ "Товары"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.Категория КАК Категория,
	|	Товары.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Товары_Исходная
	|ИЗ
	|	&Товары КАК Товары
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Товары с настройкой "Номенклатура" (только элементы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НастройкаКонтроля.ВидЦены КАК ВидЦены,
	|	НастройкаКонтроля.Валюта КАК Валюта,
	|	НастройкаКонтроля.Процент КАК Процент
	|ПОМЕСТИТЬ ВТ_Товары_ПоНоменклатуре
	|ИЗ
	|	ВТ_Товары_Исходная КАК Товары
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкаКонтроляПоНоменклатуре КАК НастройкаКонтроля
	|		ПО Товары.Номенклатура = НастройкаКонтроля.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Товары с настройкой "Номенклатура" (только группы)
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Товары.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ВидЦены КАК ВидЦены,
	|	Товары.Валюта КАК Валюта,
	|	Товары.Процент КАК Процент
	|ПОМЕСТИТЬ ВТ_Товары_ПоГруппеНоменклатуры
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.ГруппаНоменклатуры = Значение(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Товары с настройкой "Вид номенклатуры" и категории
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.Категория КАК Категория,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НастройкаКонтроля.ВидЦены КАК ВидЦены,
	|	НастройкаКонтроля.Валюта КАК Валюта,
	|	НастройкаКонтроля.Процент КАК Процент
	|ПОМЕСТИТЬ ВТ_Товары_ПоВидуНоменклатуры
	|ИЗ
	|	ВТ_Товары_Исходная КАК Товары
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкаКонтроляПоВидуНоменклатуры КАК НастройкаКонтроля
	|		ПО Товары.ВидНоменклатуры = НастройкаКонтроля.ВидНоменклатуры
	|			И Товары.Категория = НастройкаКонтроля.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Товары со всеми настройками
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары.Номенклатура
	|		КОГДА Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоГруппеНоменклатуры.Номенклатура
	|		КОГДА Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоВидуНоменклатуры.Номенклатура
	|		ИНАЧЕ Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка)
	|		КОГДА Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоГруппеНоменклатуры.ГруппаНоменклатуры
	|		КОГДА Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК ГруппаНоменклатуры,
	|	ВЫБОР
	|		КОГДА Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|		КОГДА Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|		КОГДА Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоВидуНоменклатуры.ВидНоменклатуры
	|		ИНАЧЕ Значение(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.КатегорияНоменклатуры.ПустаяСсылка)
	|		КОГДА Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Значение(Справочник.КатегорияНоменклатуры.ПустаяСсылка)
	|		КОГДА Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоВидуНоменклатуры.Категория
	|		ИНАЧЕ Значение(Справочник.КатегорияНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Категория,
	|	ВЫБОР
	|		КОГДА Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоНоменклатуре.ВидЦены
	|		КОГДА Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоГруппеНоменклатуры.ВидЦены
	|		КОГДА Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоВидуНоменклатуры.ВидЦены
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоНоменклатуре.Валюта
	|		КОГДА Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоГруппеНоменклатуры.Валюта
	|		КОГДА Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоВидуНоменклатуры.Валюта
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоНоменклатуре.Процент
	|		КОГДА Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоГруппеНоменклатуры.Процент
	|		КОГДА Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|			ТОГДА Товары_ПоВидуНоменклатуры.Процент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Процент,
	|	ЕСТЬNULL(Товары.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ТоварыСНастройками
	|ИЗ
	|	ВТ_Товары_Исходная КАК Товары
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары_ПоНоменклатуре КАК Товары_ПоНоменклатуре
	|		ПО Товары.Номенклатура = Товары_ПоНоменклатуре.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары_ПоГруппеНоменклатуры КАК Товары_ПоГруппеНоменклатуры
	|		ПО Товары.Номенклатура = Товары_ПоГруппеНоменклатуры.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары_ПоВидуНоменклатуры КАК Товары_ПоВидуНоменклатуры
	|		ПО Товары.Номенклатура = Товары_ПоВидуНоменклатуры.Номенклатура
	|
	|ГДЕ
	|	(Товары_ПоНоменклатуре.Номенклатура ЕСТЬ НЕ NULL
	|		ИЛИ Товары_ПоВидуНоменклатуры.Номенклатура ЕСТЬ НЕ NULL
	|		ИЛИ Товары_ПоГруппеНоменклатуры.Номенклатура ЕСТЬ НЕ NULL)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Итоговый запрос
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыСНастройками.Номенклатура КАК Номенклатура,
	|	ТоварыСНастройками.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыСНастройками.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыСНастройками.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
	|	ТоварыСНастройками.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ТоварыСНастройками.Категория КАК Категория,
	|	ТоварыСНастройками.ВидЦены КАК ВидЦены,
	|	ТоварыСНастройками.Валюта КАК Валюта,
	|	ТоварыСНастройками.Процент КАК Процент,
	|	ТоварыСНастройками.Цена КАК Цена,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаПоВидуЦен,
	|	ТоварыСНастройками.Цена + (ТоварыСНастройками.Цена * (ТоварыСНастройками.Процент / 100)) КАК МинимальнаяОжидаемаяЦена
	|ИЗ
	|	ВТ_ТоварыСНастройками КАК ТоварыСНастройками
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТоварыСНастройками.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ТоварыСНастройками.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И ТоварыСНастройками.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|			И ТоварыСНастройками.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|			И ТоварыСНастройками.Валюта = ЦеныНоменклатурыСрезПоследних.Валюта
	|";
	
	// #17006 контроль на конец дня, чтобы не было вопроса при каждой записи
	//Запрос.УстановитьПараметр("Дата", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("Дата", КонецДня(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("ДокументКонтроля", ДокументКонтроля);
	Запрос.УстановитьПараметр("Товары", Товары);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЦенаПоВидуЦен = Выборка.ЦенаПоВидуЦен;
		
		// Если валюта документа и валюта в настройках контроля разная, пересчитаем
		Если НЕ ДокументСсылка.Валюта = Выборка.Валюта Тогда
			ЦенаПоВидуЦен = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Выборка.Валюта, ДокументСсылка.Валюта, ДокументСсылка.Дата, ЦенаПоВидуЦен);
		КонецЕсли;
		
		// Если установленная цена больше или равна минимальной расчетной [Цена поступления + процент наценки], тогда пропускаем
		Если ЦенаПоВидуЦен >= Выборка.МинимальнаяОжидаемаяЦена Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанных = новый Структура;
		СтруктураДанных.Вставить("ВидЦены", Выборка.ВидЦены);
		СтруктураДанных.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДанных.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
		СтруктураДанных.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		СтруктураДанных.Вставить("ЦенаПоступления", Выборка.Цена);
		СтруктураДанных.Вставить("Цена", Выборка.МинимальнаяОжидаемаяЦена);
		СтруктураДанных.Вставить("ТекущаяЦенаПоВидуЦен", Выборка.ЦенаПоВидуЦен);
		СтруктураДанных.Вставить("Процент", Выборка.Процент);
		
		МассивЦенКУстановке.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Проверка прав на создание документа "Установка цен номенклатуры"
	Если НЕ ПравоДоступа("Добавление", Метаданные.Документы.УстановкаЦенНоменклатуры) Тогда
		Сообщить("По результатам контроля наценки цен, есть позиции к установке новых цен.
		|Но у текущего пользователя недостаточно прав на создание документа ""Установка цен номенклатуры"".");
		Возврат новый Массив;
	КонецЕсли;
	
	Возврат МассивЦенКУстановке;
	
КонецФункции
//-- №14786
